# ParameterFilterRuleFactory Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterFilterRuleFactory Properties
ParameterFilterRuleFactory Class See Also
---
The ParameterFilterRuleFactory type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace